# Official repository packages
# Install with: sudo pacman -S --needed - < packages/pacman.txt

# Shell & terminal
zsh
git
curl
wget
foot
tmux
fzf
fd
ripgrep
jq
zoxide
tldr

# CLI tools
htop
fastfetch
ncdu
wl-clipboard
stow
keychain
tree
rsync
aria2
lsof

# Dev runtimes
go
dotnet-sdk
python
python-pip
python-pipx

# Java LTS versions (official repos)
jdk17-openjdk
jdk21-openjdk
jdk25-openjdk

# Docker
docker
docker-buildx
docker-compose

# Virtualization
qemu-desktop

# Build
base-devel
cmake

# GitHub
github-cli

# Fonts
noto-fonts
noto-fonts-cjk
ttf-dejavu

# Browsers
chromium
firefox

# Security / networking
nmap
smbclient
hashcat
python-impacket
proxychains-ng
openbsd-netcat
gawk
nano
vim
lm_sensors
binwalk
bettercap
aircrack-ng
socat
maven
flameshot
xclip
ufw
gufw
